alvroble/esp-idf-lvgl-lab/sdkconfig.defaults
# =============================================================================
# ESP32-S3 Camera LCD Demo - SDK Configuration Defaults
# =============================================================================
# This file contains the default configuration for the project.
# These settings are applied when you run 'idf.py set-target esp32s3'

# -----------------------------------------------------------------------------
# Target Selection
# -----------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# -----------------------------------------------------------------------------
# ESP32-S3 Specific Settings
# -----------------------------------------------------------------------------
# Set the CPU frequency to 240MHz for best performance
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# -----------------------------------------------------------------------------
# PSRAM Configuration (CRITICAL for camera!)
# -----------------------------------------------------------------------------
# The ESP32-S3-Touch-LCD-3.5 has 8MB PSRAM which is essential for camera buffers
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Allow allocating large buffers in PSRAM
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Enable heap allocation in PSRAM
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# -----------------------------------------------------------------------------
# Flash Configuration
# -----------------------------------------------------------------------------
# The board has 16MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# -----------------------------------------------------------------------------
# Partition Table
# -----------------------------------------------------------------------------
# Use larger partition for app (16MB flash allows more space)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# -----------------------------------------------------------------------------
# Camera Configuration
# -----------------------------------------------------------------------------
# Enable camera driver
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=32768

# -----------------------------------------------------------------------------
# LVGL Configuration
# -----------------------------------------------------------------------------
# Enable LVGL logging for debugging (disable in production for performance)
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y

# Color depth (16-bit RGB565)
CONFIG_LV_COLOR_DEPTH_16=y

# Swap bytes for correct color display on this LCD
CONFIG_LV_COLOR_16_SWAP=y

# Enable fonts we need
CONFIG_LV_FONT_MONTSERRAT_20=y

# Performance optimizations
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n

# -----------------------------------------------------------------------------
# FreeRTOS Configuration
# -----------------------------------------------------------------------------
# Increase timer task stack size (needed for LVGL timer callbacks)
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Enable FreeRTOS assertions for debugging
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# -----------------------------------------------------------------------------
# Memory Configuration
# -----------------------------------------------------------------------------
# Increase main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# -----------------------------------------------------------------------------
# Compiler Configuration
# -----------------------------------------------------------------------------
# Optimize for performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# -----------------------------------------------------------------------------
# Log Configuration
# -----------------------------------------------------------------------------
# Set default log level to Info (change to DEBUG for more verbose output)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
